Tekla Open API Reference for Tekla Structures 2025
ReinforcementSelectionForm Constructor
Overload List
Name | Description
ReinforcementSelectionForm(List<RebarItem>)
 Creates a new instance of the ReinforcementSelectionForm.
ReinforcementSelectionForm(List<RebarItem>, String, String, Double)
 Creates a new instance of the ReinforcementSelectionForm and will select in the tree the rebar that contains the given parameters (if possible).
ReinforcementSelectionForm(List<RebarItem>, String, String, Double, String)
 Creates a new instance of the ReinforcementSelectionForm and will select in the tree the rebar that contains the given parameters (if possible).
Top
See Also
Reference
ReinforcementSelectionForm Class
Tekla.Structures.Dialog.UIControls Namespace